Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# debug.devBuildBanner.description
source: Controls the red debug-build label below the sidebar footer.
ar: يتحكم في تسمية بنية التطوير الحمراء أسفل تذييل الشريط الجانبي.
de: Steuert das rote Debug-Build-Label unter der Fußzeile der Seitenleiste.
es: Controla la etiqueta roja de versión de depuración debajo del pie de página de la barra lateral.
fr: Contrôle l'étiquette rouge de build de développement sous le pied de page de la barre latérale.
ja: サイドバーのフッター下にある赤い開発ビルドラベルの表示を切り替えます。
ko: 사이드바 하단 아래의 빨간색 개발 빌드 라벨 표시를 전환합니다.
uk: Керує показом червоної позначки збірки для розробки під нижньою частиною бічної панелі.
zh_hans: 控制侧边栏底部下方的红色调试构建标签。
zh_hant: 控制側邊欄頁尾下方的紅色偵錯版本標籤。

# debug.devBuildBanner.show
source: Show Dev Build Banner
ar: إظهار لافتة بنية التطوير
de: Dev-Build-Banner anzeigen
es: Mostrar banner de versión de desarrollo
fr: Afficher la bannière de build de développement
ja: 開発ビルドバナーを表示
ko: 개발 빌드 배너 표시
uk: Показати банер версії для розробки
zh_hans: 显示开发构建横幅
zh_hant: 顯示開發版本橫幅

# debug.devBuildBanner.title
source: THIS IS A DEV BUILD
ar: هذه بنية تطويرية
de: DIES IST EIN DEV-BUILD
es: ESTA ES UNA VERSIÓN DE DESARROLLO
fr: CECI EST UN BUILD DE DÉVELOPPEMENT
ja: これは開発ビルドです
ko: 개발 빌드입니다
uk: ЦЕ ВЕРСІЯ ДЛЯ РОЗРОБКИ
zh_hans: 这是开发构建
zh_hant: 此為開發版本

# debug.devWindowDisplay.clear
source: Clear (system default)
ar: مسح (الافتراضي للنظام)
de: Löschen (Systemstandard)
es: Borrar (predeterminado del sistema)
fr: Effacer (valeur système par défaut)
ja: クリア（システムデフォルト）
ko: 지우기(시스템 기본값)
uk: Очистити (системне за замовчуванням)
zh_hans: 清除（系统默认）
zh_hant: 清除 (系統預設)

# debug.devWindowDisplay.current
source: Current: %@
ar: الحالي: %@
de: Aktuell: %@
es: Actual: %@
fr: Actuel : %@
ja: 現在: %@
ko: 현재: %@
uk: Поточний: %@
zh_hans: 当前：%@
zh_hant: 目前：%@

# debug.devWindowDisplay.currentNone
source: Current: (system default)
ar: الحالي: (الافتراضي للنظام)
de: Aktuell: (Systemstandard)
es: Actual: (predeterminado del sistema)
fr: Actuel : (valeur système par défaut)
ja: 現在: (システムデフォルト)
ko: 현재: (시스템 기본값)
uk: Поточний: (системне за замовчуванням)
zh_hans: 当前：（系统默认）
zh_hant: 目前：(系統預設)

# debug.devWindowDisplay.description
source: New DEBUG cmux windows open on the selected display. Shared across all tagged dev builds; applied at window creation.
ar: تفتح نوافذ cmux لتصحيح الأخطاء (DEBUG) الجديدة على الشاشة المحددة. مشتركة عبر جميع بنيات التطوير المميزة بعلامات؛ وتُطبق عند إنشاء النافذة.
de: Neue DEBUG-cmux-Fenster öffnen sich auf dem ausgewählten Bildschirm. Gemeinsam genutzt von allen getaggten Dev-Builds; wird bei der Fenstererstellung angewendet.
es: Las nuevas ventanas de depuración (DEBUG) de cmux se abren en la pantalla seleccionada. Compartido en todas las versiones de desarrollo etiquetadas; se aplica al crear la ventana.
fr: Les nouvelles fenêtres cmux de DÉBOGAGE s'ouvrent sur l'écran sélectionné. Partagé entre tous les builds de développement étiquetés ; appliqué à la création de la fenêtre.
ja: 新しいDEBUG cmuxウィンドウは選択したディスプレイで開きます。すべてのタグ付き開発ビルドで共有され、ウィンドウ作成時に適用されます。
ko: 새 DEBUG cmux 창이 선택한 디스플레이에서 열립니다. 모든 태그가 지정된 개발 빌드에서 공유되며 창 생성 시 적용됩니다.
uk: Нові вікна DEBUG cmux відкриваються на вибраному дисплеї. Спільне для всіх позначених тегами складань розробки; застосовується під час створення вікна.
zh_hans: 新的 DEBUG cmux 窗口会在所选显示器上打开。所有带标记的开发构建共用此设置；在创建窗口时生效。
zh_hant: 新的偵錯 cmux 視窗將在選定的顯示器上開啟。此設定在所有標記的開發版本之間共用，並在建立視窗時套用。

# debug.devWindowDisplay.refresh
source: Refresh displays
ar: تحديث الشاشات
de: Bildschirme aktualisieren
es: Actualizar pantallas
fr: Actualiser les écrans
ja: ディスプレイを更新
ko: 디스플레이 새로 고침
uk: Оновити дисплеї
zh_hans: 刷新显示器
zh_hant: 重新整理顯示器

# debug.devWindowDisplay.title
source: Dev Window Display
ar: شاشة عرض نافذة التطوير
de: Dev-Fenster-Bildschirm
es: Pantalla de ventana de desarrollo
fr: Écran des fenêtres de développement
ja: 開発ウィンドウディスプレイ
ko: 개발 창 디스플레이
uk: Дисплей вікна розробки
zh_hans: 开发窗口显示器
zh_hant: 開發視窗顯示器

# debug.menu.aboutTitlebarDebug
source: About Titlebar Debug…
ar: تصحيح أخطاء شريط العنوان "حول"…
de: Über Titelleisten-Debug…
es: Acerca de la depuración de la barra de título…
fr: À propos du débogage de la barre de titre…
ja: Aboutタイトルバーデバッグ…
ko: 타이틀바 디버그 정보…
zh_hans: 「关于」标题栏调试…
zh_hant: 關於標題列偵錯…

# debug.menu.bonsplitTabBarDebug
source: Bonsplit Tab Bar Debug…
ar: تصحيح أخطاء شريط علامات تبويب Bonsplit…
de: Bonsplit-Tab-Leisten-Debug…
es: Depuración de la barra de pestañas de Bonsplit…
fr: Débogage de la barre d'onglets Bonsplit…
ja: Bonsplitタブバーのデバッグ…
ko: Bonsplit 탭 바 디버그…
zh_hans: Bonsplit 标签栏调试…
zh_hant: Bonsplit 標籤頁列偵錯…

# debug.menu.browserProfilePopoverDebug
source: Browser Profile Popover Debug…
ar: تصحيح أخطاء نافذة ملف تعريف المتصفح المنبثقة…
de: Browser-Profil-Popover-Debug…
es: Depuración del popover de perfil de navegador…
fr: Débogage de la fenêtre contextuelle de profil du navigateur…
ja: ブラウザープロファイルポップオーバーのデバッグ…
ko: 브라우저 프로필 팝오버 디버그…
uk: Налагодження спливного вікна профілю браузера…
zh_hans: 浏览器配置文件弹出框调试…
zh_hant: 瀏覽器設定檔彈出視窗偵錯…

# debug.menu.browserToolbarButtonSpacing
source: Browser Toolbar Button Spacing
ar: تباعد أزرار شريط أدوات المتصفح
de: Browser-Symbolleistenschaltflächen-Abstand
es: Espaciado de botones de la barra de herramientas del navegador
fr: Espacement des boutons de la barre d'outils du navigateur
ja: ブラウザーツールバーのボタン間隔
ko: 브라우저 도구 모음 버튼 간격
uk: Відстань кнопок панелі інструментів браузера
zh_hans: 浏览器工具栏按钮间距
zh_hant: 瀏覽器工具列按鈕間距

# debug.menu.devWindowDisplay
source: Dev Window Display…
ar: شاشة عرض نافذة التطوير…
de: Dev-Fenster-Bildschirm…
es: Pantalla de ventana de desarrollo…
fr: Écran des fenêtres de développement…
ja: 開発ウィンドウディスプレイ…
ko: 개발 창 디스플레이…
uk: Дисплей вікна розробки…
zh_hans: 开发窗口显示器…
zh_hant: 開發視窗顯示器…

# debug.menu.feedButtonStyleDebug
source: Feed Button Style Debug…
ar: تصحيح أخطاء نمط زر الموجز…
de: Feed-Schaltflächenstil-Debug…
es: Depuración de estilo de botón de feed…
fr: Débogage du style de bouton de flux…
ja: フィードボタンスタイルのデバッグ…
ko: 피드 버튼 스타일 디버그…
zh_hans: Feed 按钮样式调试…
zh_hant: 動態按鈕樣式偵錯…

# debug.menu.feedTextEditorDebug
source: Feed Text Editor Lab…
ar: مختبر محرر نصوص الموجز…
de: Feed-Texteditor-Labor…
es: Laboratorio del editor de texto del feed…
fr: Labo de l'éditeur de texte de flux…
ja: フィードテキストエディタラボ…
ko: 피드 텍스트 편집기 실험실…
zh_hans: Feed 文本编辑器实验室…
zh_hant: 動態文字編輯器實驗室…

# debug.menu.irohTransport
source: Iroh Transport
ar: نقل Iroh
es: Transporte Iroh
fr: Transport Iroh
ja: Iroh トランスポート
ko: Iroh 전송
zh_hans: Iroh 传输
zh_hant: Iroh 傳輸

# debug.menu.irohTransport.automatic
source: Automatic
ar: تلقائي
de: Automatisch
es: Automático
fr: Automatique
ja: 自動
ko: 자동
zh_hans: 自动
zh_hant: 自動

# debug.menu.irohTransport.noRelay
source: No Relay (Direct Only)
ar: لا يوجد ترحيل (مباشر فقط)
de: Kein Relais (nur direkt)
es: Sin retransmisión (solo directo)
fr: Pas de relais (direct uniquement)
ja: リレーなし（直接接続のみ）
ko: 릴레이 없음(직접 전용)
zh_hans: 不使用中继（仅直连）
zh_hant: 無中繼（僅限直接）

# debug.menu.irohTransport.relayOnly
source: Relay Only
ar: التتابع فقط
de: Nur Relais
es: Sólo relé
fr: Relais uniquement
ja: リレーのみ
ko: 릴레이 전용
zh_hans: 仅使用中继
zh_hant: 僅中繼

# debug.menu.openAgentGuiReact
source: Open Agent GUI (React)
ar: فتح واجهة مستخدم الوكيل (React)
de: Agenten-GUI öffnen (React)
es: Abrir GUI del agente (React)
fr: Ouvrir l'interface graphique de l'agent (React)
ja: Agent GUI を開く (React)
ko: 에이전트 GUI 열기 (React)
zh_hans: 打开代理 GUI（React）
zh_hant: 開啟 Agent GUI (React)

# debug.menu.openAgentGuiSolid
source: Open Agent GUI (Solid)
ar: فتح واجهة مستخدم الوكيل (Solid)
de: Agenten-GUI öffnen (Solid)
es: Abrir GUI del agente (Solid)
fr: Ouvrir l'interface graphique de l'agent (Solid)
ja: Agent GUI を開く (Solid)
ko: 에이전트 GUI 열기 (Solid)
zh_hans: 打开代理 GUI（Solid）
zh_hant: 開啟 Agent GUI (Solid)

# debug.menu.openStressWorkspacesWithLoadedSurfaces
source: Open Stress Workspaces and Load All Terminals
ar: فتح مساحات عمل الضغط وتحميل جميع الطرفيات
de: Stress-Arbeitsbereiche öffnen und alle Terminals laden
es: Abrir espacios de trabajo de prueba de esfuerzo y cargar todas las terminales
fr: Ouvrir les espaces de travail de test de charge et charger tous les terminaux
ja: 負荷テスト用ワークスペースを開いてすべてのターミナルを読み込む
ko: 스트레스 워크스페이스 열기 및 모든 터미널 로드
uk: Відкрити стрес-тест робочих областей і завантажити всі термінали
zh_hans: 打开压力测试工作区并加载所有终端
zh_hant: 開啟壓力測試工作區並載入所有終端機

# debug.menu.pdfPreviewChromeDebug
source: PDF Preview Chrome Debug…
ar: تصحيح أخطاء واجهة معاينة PDF…
de: PDF-Vorschau-Chrome-Debug…
es: Depuración de la interfaz de vista previa de PDF…
fr: Débogage de l'interface d'aperçu PDF…
ja: PDFプレビュークロームのデバッグ…
ko: PDF 미리보기 크롬 디버그…
uk: Налагодження хрому PDF-перегляду…
zh_hans: PDF 预览外框调试…
zh_hant: PDF 預覽外殼偵錯…

# debug.menu.showCanvasCommandScrollHint
source: Show Canvas Scroll Hint
ar: إظهار تلميح التمرير في اللوحة
bs: Prikaži savjet za pomicanje platna
da: Vis scrollhint for lærred
de: Canvas-Scrollhinweis anzeigen
es: Mostrar indicación de desplazamiento del lienzo
fr: Afficher l’indice de défilement du canevas
it: Mostra il suggerimento di scorrimento del canvas
ja: キャンバスのスクロールヒントを表示
ko: 캔버스 스크롤 힌트 표시
nb: Vis rulletips for lerret
pl: Pokaż wskazówkę przewijania obszaru roboczego
pt_br: Mostrar dica de rolagem da tela
ru: Показать подсказку прокрутки холста
th: แสดงคำแนะนำการเลื่อนแคนวาส
tr: Tuval kaydırma ipucunu göster
uk: Показати підказку прокручування полотна
zh_hans: 显示画布滚动提示
zh_hant: 顯示畫布捲動提示

# debug.menu.sidebarFooterIconBalance
source: Footer Icon Balance Lab…
ar: مختبر توازن أيقونات التذييل…
de: Fußzeilen-Symbol-Balance-Labor…
es: Laboratorio de equilibrio de iconos del pie de página…
fr: Labo d'équilibrage des icônes du pied de page…
ja: フッターアイコンバランスラボ…
ko: 하단 아이콘 균형 실험실…
zh_hans: 底栏图标平衡实验室…
zh_hant: 頁尾圖示平衡實驗室…

# debug.menu.startupAppearanceDebug
source: Startup Appearance Debug…
ar: تصحيح أخطاء مظهر بدء التشغيل…
de: Start-Erscheinungsbild-Debug…
es: Depuración de apariencia de inicio…
fr: Débogage de l'apparence au démarrage…
ja: 起動時の外観デバッグ…
ko: 시작 외관 디버그…
zh_hans: 启动外观调试…
zh_hant: 啟動外觀偵錯…

# debug.menu.tabBarBackdropLab
source: Tab Bar Backdrop Lab…
ar: مختبر خلفية شريط علامات التبويب…
de: Tab-Leisten-Hintergrund-Labor…
es: Laboratorio de fondo de la barra de pestañas…
fr: Labo de fond de barre d'onglets…
ja: タブバー背景ラボ…
ko: 탭 바 백드롭 실험실…
zh_hans: 标签栏背景实验室…
zh_hant: 標籤頁列背景幕實驗室…

# debug.menu.titlebarLayoutDebug
source: Titlebar Layout Debug...
ar: تصحيح أخطاء تخطيط شريط العنوان...
de: Titelleisten-Layout-Debug...
es: Depuración de diseño de la barra de título...
fr: Débogage de la disposition de la barre de titre...
ja: タイトルバーレイアウトデバッグ...
ko: 타이틀바 레이아웃 디버그...
zh_hans: 标题栏布局调试...
zh_hant: 標題列版面配置偵錯...

# debug.sidebarFooterIconBalance.description
source: Tune each icon live, compare sharp and squint previews, then use the cards to explore Help weights.
ar: اضبط كل أيقونة مباشرة، وقارن بين المعاينات الحادة والمغشاة، ثم استخدم البطاقات لاستكشاف أوزان المساعدة.
de: Passen Sie jedes Symbol live an, vergleichen Sie scharfe und zugekniffene Vorschauen, und verwenden Sie dann die Karten, um die Gewichte der Hilfe zu erkunden.
es: Ajuste cada icono en vivo, compare las vistas previas nítidas y con ojos entrecerrados, luego use las tarjetas para explorar los pesos de Ayuda.
fr: Ajustez chaque icône en direct, comparez les aperçus nets et flous (loucher), puis utilisez les cartes pour explorer les graisses de l'Aide.
ja: 各アイコンをライブ調整し、鮮明表示とスクイント表示を比較してから、カードでヘルプのウェイトを確認します。
ko: 각 아이콘을 실시간으로 조정하고, 선명한 미리보기와 실눈 미리보기를 비교한 다음 카드를 사용하여 도움말 가중치를 탐색해 보세요.
zh_hans: 实时调整每个图标，对比清晰预览和眯眼预览，然后用卡片探索「帮助」图标的字重。
zh_hant: 即時微調每個圖示，比對清晰與瞇眼預覽，然後使用卡片探索「說明」權重。

# debug.sidebarFooterIconBalance.helpIcon
source: Help icon
ar: أيقونة المساعدة
de: Hilfe-Symbol
es: Icono de ayuda
fr: Icône d'aide
ja: ヘルプアイコン
ko: 도움말 아이콘
zh_hans: 帮助图标
zh_hant: 「說明」圖示

# debug.sidebarFooterIconBalance.helpSize
source: Help
ar: مساعدة
de: Hilfe
es: Ayuda
fr: Aide
ja: ヘルプ
ko: 도움말
zh_hans: 帮助
zh_hant: 說明

# debug.sidebarFooterIconBalance.hoverIntensity
source: Hover intensity
ar: كثافة التحويم
de: Hover-Intensität
es: Intensidad al pasar el cursor
fr: Intensité du survol
ja: ホバーの強さ
ko: 호버 강도
zh_hans: 悬停强度
zh_hant: 懸停強度

# debug.sidebarFooterIconBalance.hoverPreview
source: Hover preview
ar: معاينة التحويم
de: Hover-Vorschau
es: Vista previa al pasar el cursor
fr: Aperçu au survol
ja: ホバープレビュー
ko: 호버 미리보기
zh_hans: 悬停预览
zh_hant: 懸停預覽

# debug.sidebarFooterIconBalance.iconSizes
source: Icon sizes
ar: أحجام الأيقونات
de: Symbolgrößen
es: Tamaños de icono
fr: Tailles des icônes
ja: アイコンサイズ
ko: 아이콘 크기
zh_hans: 图标尺寸
zh_hant: 圖示大小

# debug.sidebarFooterIconBalance.mobileSize
source: Mobile
ar: المحمول
de: Mobil
es: Móvil
ja: モバイル
ko: 모바일
zh_hans: 移动端
zh_hant: 行動裝置

# debug.sidebarFooterIconBalance.opticalBalance
source: Optical balance
ar: التوازن البصري
de: Optische Balance
es: Equilibrio óptico
fr: Équilibre optique
ja: 視覚的バランス
ko: 시각적 균형
zh_hans: 视觉平衡
zh_hant: 視覺平衡

# debug.sidebarFooterIconBalance.profileDisplay
source: Profile display
ar: عرض ملف التعريف
de: Profilanzeige
es: Visualización de perfil
fr: Affichage du profil
ja: プロフィール表示
ko: 프로필 표시
zh_hans: 个人资料显示
zh_hant: 個人資料顯示

# debug.sidebarFooterIconBalance.profileDisplay.icon
source: Icon
ar: رمز
de: Symbol
es: Icono
fr: Icône
ja: アイコン
ko: 상
zh_hans: 图标
zh_hant: 圖示

# debug.sidebarFooterIconBalance.profileDisplay.picture
source: Picture
ar: صورة
de: Bild
es: Imagen
fr: Image
ja: 画像
ko: 사진
zh_hans: 图片
zh_hant: 圖片

# debug.sidebarFooterIconBalance.profileIcon
source: Profile icon
ar: أيقونة ملف التعريف
de: Profil-Symbol
es: Icono de perfil
fr: Icône de profil
ja: プロフィールアイコン
ko: 프로필 아이콘
zh_hans: 个人资料图标
zh_hant: 個人資料圖示

# debug.sidebarFooterIconBalance.profileSize
source: Profile
ar: ملف التعريف
de: Profil
es: Perfil
fr: Profil
ja: プロフィール
ko: 프로필
zh_hans: 个人资料
zh_hant: 個人資料

# debug.sidebarFooterIconBalance.referenceNote
source: Cell guides show geometric alignment; the squint preview compares optical weight.
ar: توضح أدلة الخلايا المحاذاة الهندسية؛ وتقارن المعاينة المغشاة الوزن البصري.
de: Zellen-Hilfslinien zeigen die geometrische Ausrichtung; die zugekniffene Vorschau vergleicht das optische Gewicht.
es: Las guías de celda muestran la alineación geométrica; la vista previa de ojos entrecerrados compara el peso óptico.
fr: Les guides de cellules montrent l'alignement géométrique ; l'aperçu flou compare le poids optique.
ja: セルガイドは幾何学的な整列を示し、スクイント表示は視覚的なウェイトを比較します。
ko: 셀 가이드는 기하학적 정렬을 보여주며, 실눈 미리보기는 시각적 가중치를 비교합니다.
zh_hans: 单元格参考线显示几何对齐；眯眼预览用于比较视觉重量。
zh_hant: 儲存格輔助線顯示幾何對齊；瞇眼預覽則用來比對視覺權重。

# debug.sidebarFooterIconBalance.reset
source: Reset Selection
ar: إعادة تعيين التحديد
de: Auswahl zurücksetzen
es: Restablecer selección
fr: Réinitialiser la sélection
ja: 選択をリセット
ko: 선택 항목 초기화
zh_hans: 重置所选项
zh_hant: 重設選取項目

# debug.sidebarFooterIconBalance.sharpPreview
source: Sharp
ar: حاد
de: Scharf
es: Nítida
fr: Net
ja: 鮮明
ko: 선명하게
zh_hans: 清晰
zh_hant: 清晰

# debug.sidebarFooterIconBalance.showCellGuides
source: Show 22 pt cell guides
ar: إظهار أدلة الخلايا بحجم 22 نقطة
de: 22-pt-Zellen-Hilfslinien anzeigen
es: Mostrar guías de celda de 22 pt
fr: Afficher les guides de cellules de 22 pt
ja: 22 ptセルガイドを表示
ko: 22 pt 셀 가이드 표시
zh_hans: 显示 22 pt 单元格参考线
zh_hant: 顯示 22 pt 儲存格輔助線

# debug.sidebarFooterIconBalance.squintPreview
source: Squint
ar: مغشاة
de: Zugekniffen
es: Ojos entrecerrados
fr: Flou (loucher)
ja: スクイント
ko: 실눈으로 보기
zh_hans: 眯眼
zh_hant: 瞇眼

# debug.sidebarFooterIconBalance.squintRadius
source: Squint radius
ar: نصف قطر التغشية
de: Zukneif-Radius
es: Radio de ojos entrecerrados
fr: Rayon de flou
ja: スクイント半径
ko: 실눈 반경
zh_hans: 眯眼半径
zh_hant: 瞇眼半徑

# debug.sidebarFooterIconBalance.title
source: Footer Icon Balance Lab
ar: مختبر توازن أيقونات التذييل
de: Fußzeilen-Symbol-Balance-Labor
es: Laboratorio de equilibrio de iconos del pie de página
fr: Labo d'équilibrage des icônes du pied de page
ja: フッターアイコンバランスラボ
ko: 하단 아이콘 균형 실험실
zh_hans: 底栏图标平衡实验室
zh_hant: 頁尾圖示平衡實驗室

# debug.sidebarFooterIconBalance.weight.medium
source: Medium
ar: متوسط
de: Mittel
es: Media
fr: Moyen
ja: ミディアム
ko: 미디엄
zh_hans: 中等
zh_hant: 中等

# debug.sidebarFooterIconBalance.weight.regular
source: Regular
ar: عادي
de: Normal
fr: Normal
ja: レギュラー
ko: 레귤러
zh_hans: 常规
zh_hant: 常規

# debug.sidebarFooterIconBalance.weight.semibold
source: Semibold
ar: شبه سميك
de: Halbfett
es: Seminegrita
fr: Demi-gras
ja: セミボールド
ko: 세미볼드
zh_hans: 半粗体
zh_hant: 半粗體

# debug.startupAppearance.appearance.label
source: Appearance
ar: مظهر
de: Aussehen
es: Apariencia
fr: Apparence
ja: 外観
ko: 모습
zh_hans: 外观
zh_hant: 外貌

# debug.startupAppearance.applied.appearanceLabel
source: Appearance:
ar: المظهر:
de: Erscheinungsbild:
es: Apariencia:
fr: Apparence :
ja: 外観:
ko: 외관:
zh_hans: 外观：
zh_hant: 外觀：

# debug.startupAppearance.applied.configLabel
source: Config:
ar: التكوين:
de: Konfiguration:
es: Configuración:
fr: Configuration :
ja: 設定:
ko: 설정:
zh_hans: 配置：
zh_hant: 設定：

# debug.startupAppearance.applied.heading
source: Applied
ar: تم التطبيق
de: Angewendet
es: Aplicado
fr: Appliqué
ja: 適用済み
ko: 적용됨
zh_hans: 已应用
zh_hant: 已套用

# debug.startupAppearance.applied.help
source: Reloads the running app through Ghostty config update, matching startup theme resolution without editing config files.
ar: يعيد تحميل التطبيق قيد التشغيل من خلال تحديث تكوين Ghostty، ليطابق دقة سمة بدء التشغيل دون تعديل ملفات التكوين.
de: Lädt die laufende App durch ein Ghostty-Konfigurationsupdate neu, was der Start-Theme-Auflösung entspricht, ohne Konfigurationsdateien zu bearbeiten.
es: Vuelve a cargar la aplicación en ejecución mediante la actualización de la configuración de Ghostty, coincidiendo con la resolución del tema de inicio sin editar archivos de configuración.
fr: Recharge l'application en cours d'exécution via la mise à jour de la configuration de Ghostty, en faisant correspondre la résolution du thème de démarrage sans modifier les fichiers de configuration.
ja: 設定ファイルを編集せず、Ghostty 設定更新で実行中のアプリを再読み込みし、起動時のテーマ解決を再現します。
ko: 설정 파일을 직접 편집하지 않고 시작 테마 결정 방식과 일치하도록 Ghostty 설정 업데이트를 통해 실행 중인 앱을 다시 로드합니다.
zh_hans: 通过 Ghostty 配置更新重新加载正在运行的应用，无需编辑配置文件即可与启动时的主题解析保持一致。
zh_hant: 透過 Ghostty 設定更新重新載入執行中的應用程式，在不編輯設定檔的情況下，符合啟動時的佈景主題解析結果。

# debug.startupAppearance.applyPreview.button
source: Apply Preview
ar: تطبيق المعاينة
de: Vorschau anwenden
es: Aplicar vista previa
fr: Appliquer l'aperçu
ja: プレビューを適用
ko: 미리보기 적용
zh_hans: 应用预览
zh_hant: 套用預覽

# debug.startupAppearance.copySelectedConfig.button
source: Copy Selected Config
ar: نسخ التكوين المحدد
de: Ausgewählte Konfiguration kopieren
es: Copiar configuración seleccionada
fr: Copier la configuration sélectionnée
ja: 選択中の設定をコピー
ko: 선택된 설정 복사
zh_hans: 复制所选配置
zh_hant: 複製選取的設定

# debug.startupAppearance.mode.dark
source: Force Dark
ar: فرض المظهر الداكن
de: Dunkel erzwingen
es: Forzar oscuro
fr: Forcer le mode sombre
ja: ダークを強制
ko: 다크 모드 강제
zh_hans: 强制深色
zh_hant: 強制深色

# debug.startupAppearance.mode.light
source: Force Light
ar: فرض المظهر الفاتح
de: Hell erzwingen
es: Forzar claro
fr: Forcer le mode clair
ja: ライトを強制
ko: 라이트 모드 강제
zh_hans: 强制浅色
zh_hant: 強制淺色

# debug.startupAppearance.mode.stored
source: Stored App Setting
ar: إعداد التطبيق المخزن
de: Gespeicherte App-Einstellung
es: Ajuste de aplicación guardado
fr: Paramètre de l'application enregistré
ja: 保存済みのアプリ設定
ko: 저장된 앱 설정
zh_hans: 已存储的应用设置
zh_hant: 儲存的應用程式設定

# debug.startupAppearance.preview.heading
source: Preview
ar: معاينة
de: Vorschau
es: Avance
fr: Aperçu
ja: プレビュー
ko: 시사
zh_hans: 预览
zh_hant: 預覽

# debug.startupAppearance.profile.freshInstall.detail
source: No user Ghostty settings, so cmux applies its managed default colors.
ar: لا توجد إعدادات Ghostty للمستخدم، لذا يطبق cmux ألوانه الافتراضية المدارة.
de: Keine Ghostty-Einstellungen des Benutzers, daher wendet cmux seine verwalteten Standardfarben an.
es: No hay ajustes de Ghostty del usuario, por lo que cmux aplica sus colores predeterminados administrados.
fr: Aucun paramètre utilisateur Ghostty, cmux applique donc ses couleurs par défaut managées.
ja: ユーザーの Ghostty 設定がないため、cmux の管理するデフォルト色を適用します。
ko: 사용자 Ghostty 설정이 없으므로, cmux가 관리하는 기본 색상을 적용합니다.
zh_hans: 没有用户的 Ghostty 设置，因此 cmux 应用它托管的默认配色。
zh_hant: 沒有使用者 Ghostty 設定，因此 cmux 會套用其管理的預設色彩。

# debug.startupAppearance.profile.freshInstall.title
source: Fresh Install
ar: تثبيت جديد
de: Frische Installation
es: Instalación limpia
fr: Nouvelle installation
ja: 新規インストール
ko: 신규 설치
zh_hans: 全新安装
zh_hant: 全新安裝

# debug.startupAppearance.profile.realUserConfig.detail
source: Loads your actual Ghostty and cmux config files.
ar: يحمل ملفات تكوين Ghostty وcmux الفعلية الخاصة بك.
de: Lädt Ihre tatsächlichen Ghostty- und cmux-Konfigurationsdateien.
es: Carga sus archivos de configuración reales de Ghostty y cmux.
fr: Charge vos véritables fichiers de configuration Ghostty et cmux.
ja: 実際の Ghostty と cmux の設定ファイルを読み込みます。
ko: 실제 Ghostty 및 cmux 설정 파일을 로드합니다.
zh_hans: 加载你实际的 Ghostty 和 cmux 配置文件。
zh_hant: 載入您實際的 Ghostty 與 cmux 設定檔。

# debug.startupAppearance.profile.realUserConfig.title
source: Real User Config
ar: تكوين مستخدم حقيقي
de: Echte Benutzerkonfiguration
es: Configuración de usuario real
fr: Configuration utilisateur réelle
ja: 実際のユーザー設定
ko: 실제 사용자 설정
zh_hans: 真实用户配置
zh_hant: 實際使用者設定

# debug.startupAppearance.profile.userExplicitColors.detail
source: Simulates a user with direct terminal color settings and no theme.
ar: يحاكي مستخدماً بإعدادات ألوان طرفية مباشرة وبدون سمة.
de: Simuliert einen Benutzer mit direkten Terminal-Farbeinstellungen und ohne Theme.
es: Simula un usuario con ajustes de color directos de la terminal y sin tema.
fr: Simule un utilisateur avec des paramètres directs de couleur du terminal et aucun thème.
ja: テーマなしでターミナル色を直接設定しているユーザーをシミュレートします。
ko: 테마 없이 직접 터미널 색상을 설정한 사용자를 시뮬레이션합니다.
zh_hans: 模拟直接设置了终端颜色且没有主题的用户。
zh_hant: 模擬具有直接終端機色彩設定且無佈景主題的使用者。

# debug.startupAppearance.profile.userExplicitColors.title
source: User Explicit Colors
ar: ألوان مستخدم صريحة
de: Explizite Benutzerfarben
es: Colores explícitos del usuario
fr: Couleurs utilisateur explicites
ja: ユーザー指定色
ko: 사용자 직접 지정 색상
zh_hans: 用户显式颜色
zh_hant: 使用者指定色彩

# debug.startupAppearance.profile.userSingleTheme.detail
source: Simulates a user with one Ghostty theme applied in both appearances.
ar: يحاكي مستخدماً يطبق سمة Ghostty واحدة في كلا المظهرين.
de: Simuliert einen Benutzer mit einem einzigen angewendeten Ghostty-Theme in beiden Erscheinungsbildern.
es: Simula un usuario con un solo tema de Ghostty aplicado en ambas apariencias.
fr: Simule un utilisateur avec un seul thème Ghostty appliqué aux deux apparences.
ja: ライトとダークの両方に同じ Ghostty テーマを適用しているユーザーをシミュレートします。
ko: 두 가지 외관 모두에 하나의 Ghostty 테마를 적용한 사용자를 시뮬레이션합니다.
zh_hans: 模拟在两种外观下都应用同一个 Ghostty 主题的用户。
zh_hant: 模擬在兩種外觀下均套用單一 Ghostty 佈景主題的使用者。

# debug.startupAppearance.profile.userSingleTheme.title
source: User Single Theme
ar: سمة مستخدم واحدة
de: Einzelnes Benutzer-Theme
es: Tema único del usuario
fr: Thème unique de l'utilisateur
ja: ユーザー単一テーマ
ko: 사용자 단일 테마
zh_hans: 用户单一主题
zh_hant: 使用者單一佈景主題

# debug.startupAppearance.profile.userThemePair.detail
source: Simulates a user with an explicit light/dark Ghostty theme.
ar: يحاكي مستخدماً لديه سمة Ghostty صريحة فاتحة/داكنة.
de: Simuliert einen Benutzer mit einem expliziten hellen/dunklen Ghostty-Theme.
es: Simula un usuario con un tema explícito claro/oscuro de Ghostty.
fr: Simule un utilisateur avec un thème Ghostty clair/sombre explicite.
ja: ライトとダークの Ghostty テーマを明示的に設定しているユーザーをシミュレートします。
ko: 명시적인 라이트/다크 Ghostty 테마가 설정된 사용자를 시뮬레이션합니다.
zh_hans: 模拟显式设置了浅色/深色 Ghostty 主题的用户。
zh_hant: 模擬具有明確淺色/深色 Ghostty 佈景主題的使用者。

# debug.startupAppearance.profile.userThemePair.title
source: User Light/Dark Theme
ar: سمة مستخدم فاتحة/داكنة
de: Helles/Dunkles Benutzer-Theme
es: Tema claro/oscuro del usuario
fr: Thème clair/sombre de l'utilisateur
ja: ユーザーのライト/ダークテーマ
ko: 사용자 라이트/다크 테마
zh_hans: 用户浅色/深色主题
zh_hant: 使用者淺色/深色佈景主題
